
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
main.c
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
WX, 2005
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

#include "type.h"
#include "stdio.h"
#include "const.h"
#include "protect.h"
#include "string.h"
#include "fs.h"
#include "proc.h"
#include "tty.h"
#include "console.h"
#include "global.h"
#include "proto.h"

#define	MAX_USER		10
#define	MAX_USER_FILE	100
#define MAX_USER_DIR	5
#define	MAX_PSWD_LEN	12

#define	MAX_FILES		80
#define	MAX_DIRS		50


char location[MAX_FILENAME_LEN] = "root";
char files[MAX_FILES][MAX_FILENAME_LEN];
int  filequeue[MAX_FILES];
int  filecount = 0;
char dirs[MAX_DIRS][MAX_FILENAME_LEN];
int  dirqueue[MAX_FILES];
int  dircount = 0;

void shabby_shell(const char * tty_name);

int isDir(const char * filepath);

void getFilepath(char *filepath, char * filename);
void getDirFilepath(char *filepath, char * filename);
void getDirpathAndFilename(char * dirpath, char * filename, char * filepath);

int getFreeFilePos();
int getFreeDirPos();
int getPosInDirQueue(char * filepath);


void addFileIntoDir(const char * dirpath, char * filename);
void deleteFileFromDir(const char * dirpath, char * filename);

void initFS();
void welcome();
void clear();
void showProcess();
void help();
void colorful();
void createFile(char * filepath, char *filename, char * buf);

	struct task * t;

	struct proc * p = proc_table;



	char * stk = task_stack + STACK_SIZE_TOTAL;



	for (i = 0; i < NR_TASKS + NR_PROCS; i++, p++, t++) {

		if (i >= NR_TASKS + NR_NATIVE_PROCS) {

			p->p_flags = FREE_SLOT;

			continue;

		}



		if (i < NR_TASKS) {     /* TASK */

			t = task_table + i;

			priv = PRIVILEGE_TASK;

			rpl = RPL_TASK;

			eflags = 0x1202;/* IF=1, IOPL=1, bit 2 is always 1 */

			prio = 15;

		}

		else {                  /* USER PROC */

			t = user_proc_table + (i - NR_TASKS);

			priv = PRIVILEGE_USER;

			rpl = RPL_USER;

			eflags = 0x202;	/* IF=1, bit 2 is always 1 */

			prio = 5;

		}



		strcpy(p->name, t->name);	/* name of the process */

		p->p_parent = NO_TASK;



		if (strcmp(t->name, "INIT") != 0) {

			p->ldts[INDEX_LDT_C] = gdt[SELECTOR_KERNEL_CS >> 3];

			p->ldts[INDEX_LDT_RW] = gdt[SELECTOR_KERNEL_DS >> 3];



			/* change the DPLs */

			p->ldts[INDEX_LDT_C].attr1 = DA_C | priv << 5;

			p->ldts[INDEX_LDT_RW].attr1 = DA_DRW | priv << 5;

		}

		else {		/* INIT process */

			unsigned int k_base;

			unsigned int k_limit;

			int ret = get_kernel_map(&k_base, &k_limit);

			assert(ret == 0);

			init_desc(&p->ldts[INDEX_LDT_C],

				0, /* bytes before the entry point

				   * are useless (wasted) for the

				   * INIT process, doesn't matter

				   */

				(k_base + k_limit) >> LIMIT_4K_SHIFT,

				DA_32 | DA_LIMIT_4K | DA_C | priv << 5);



			init_desc(&p->ldts[INDEX_LDT_RW],

				0, /* bytes before the entry point

				   * are useless (wasted) for the

				   * INIT process, doesn't matter

				   */

				(k_base + k_limit) >> LIMIT_4K_SHIFT,

				DA_32 | DA_LIMIT_4K | DA_DRW | priv << 5);

		}



		p->regs.cs = INDEX_LDT_C << 3 | SA_TIL | rpl;

		p->regs.ds =

			p->regs.es =

			p->regs.fs =

			p->regs.ss = INDEX_LDT_RW << 3 | SA_TIL | rpl;

		p->regs.gs = (SELECTOR_KERNEL_GS & SA_RPL_MASK) | rpl;

		p->regs.eip = (u32)t->initial_eip;

		p->regs.esp = (u32)stk;

		p->regs.eflags = eflags;



		p->ticks = p->priority = prio;



		p->p_flags = 0;

		p->p_msg = 0;

		p->p_recvfrom = NO_TASK;

		p->p_sendto = NO_TASK;

		p->has_int_msg = 0;

		p->q_sending = 0;

		p->next_sending = 0;



		for (j = 0; j < NR_FILES; j++)

			p->filp[j] = 0;



		stk -= t->stacksize;

	}



	k_reenter = 0;

	ticks = 0;



	p_proc_ready = proc_table;



	init_clock();

	init_keyboard();



	restart();



	while (1) {}

}


/*****************************************************************************
*                                get_ticks
*****************************************************************************/
PUBLIC int get_ticks()
{
	MESSAGE msg;
	reset_msg(&msg);
	msg.type = GET_TICKS;
	send_recv(BOTH, TASK_SYS, &msg);
	return msg.RETVAL;
}


/**
* @struct posix_tar_header
* Borrowed from GNU `tar'
*/
struct posix_tar_header
{				/* byte offset */
	char name[100];		/*   0 */
	char mode[8];		/* 100 */
	char uid[8];		/* 108 */
	char gid[8];		/* 116 */
	char size[12];		/* 124 */
	char mtime[12];		/* 136 */
	char chksum[8];		/* 148 */
	char typeflag;		/* 156 */
	char linkname[100];	/* 157 */
	char magic[6];		/* 257 */
	char version[2];	/* 263 */
	char uname[32];		/* 265 */
	char gname[32];		/* 297 */
	char devmajor[8];	/* 329 */
	char devminor[8];	/* 337 */
	char prefix[155];	/* 345 */
						/* 500 */
};

/*****************************************************************************
*                                untar
*****************************************************************************/
/**
* Extract the tar file and store them.
*
* @param filename The tar file.
*****************************************************************************/
void untar(const char * filename)
{
	printf("[extract `%s'", filename);
	int fd = open(filename, O_RDWR);
	assert(fd != -1);

	char buf[SECTOR_SIZE * 16];
	int chunk = sizeof(buf);

	while (1) {
		read(fd, buf, SECTOR_SIZE);
		if (buf[0] == 0)
			break;

		struct posix_tar_header * phdr = (struct posix_tar_header *)buf;

		/* calculate the file size */
		char * p = phdr->size;
		int f_len = 0;
		while (*p)
			f_len = (f_len * 8) + (*p++ - '0'); /* octal */

		int bytes_left = f_len;
		int fdout = open(phdr->name, O_CREAT | O_RDWR);
		if (fdout == -1) {
